; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph4 - mode
	thermograph3 - mode
	thermograph1 - mode
	image0 - mode
	infrared2 - mode
	GroundStation3 - direction
	GroundStation5 - direction
	Star4 - direction
	Star2 - direction
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 thermograph3)
	(supports instrument2 image0)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 image0)
	(supports instrument4 thermograph3)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared2)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
)
(:goal (and
	(pointing satellite1 Star9)
	(have_image Star6 thermograph3)
	(have_image Planet7 infrared2)
	(have_image Star8 thermograph4)
	(have_image Star9 image0)
	(have_image Phenomenon10 thermograph4)
))

)

; plan
1. (turn_to satellite1 star2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star2)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite1 star6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star6)
   goals met: 0 of 6
5. (take_image satellite1 star6 instrument2 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon10 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 6
7. (turn_to satellite0 star1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star1)
   goals met: 1 of 6
8. (take_image satellite1 phenomenon10 instrument2 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 2 of 6
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
10. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 2 of 6
11. (turn_to satellite0 planet7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet7)
   goals met: 2 of 6
12. (take_image satellite0 planet7 instrument0 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 3 of 6
13. (turn_to satellite1 star8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star8)
   goals met: 3 of 6
14. (take_image satellite1 star8 instrument2 thermograph4)
   added: (have_image star8 thermograph4)
   goals met: 4 of 6
15. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 5 of 6
16. (take_image satellite1 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 6 of 6
